#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/class6_24/learn-terraform-github-actions/runs/run-koCyqNCZAdyPVQX8

Waiting for the plan to start...

Terraform v1.10.3
on linux_amd64
Initializing plugins and modules...
aws_route_table_association.private-eu-west-1b: Refreshing state... [id=rtbassoc-0073b6e2ffbc193b2]
aws_subnet.private-eu-west-1b: Refreshing state... [id=subnet-0168a200d0f72c060]
aws_route_table_association.public-eu-west-1a: Refreshing state... [id=rtbassoc-0b0bb61cd8b840cff]
aws_route_table_association.public-eu-west-1b: Refreshing state... [id=rtbassoc-03fa91f56239d0d63]
aws_route_table_association.public-eu-west-1c: Refreshing state... [id=rtbassoc-01a844a1d2e2c2ebd]
aws_subnet.private-eu-west-1a: Refreshing state... [id=subnet-0d3a6b44cf5a1d8c3]
aws_subnet.public-eu-west-1a: Refreshing state... [id=subnet-0c5e5b97a8e875605]
aws_route_table_association.private-eu-west-1a: Refreshing state... [id=rtbassoc-075f800c77152410f]
aws_subnet.public-eu-west-1c: Refreshing state... [id=subnet-0739ae83aa326e1ef]
aws_subnet.public-eu-west-1b: Refreshing state... [id=subnet-05e0f6dc1976d5047]
aws_route_table_association.private-eu-west-1c: Refreshing state... [id=rtbassoc-0cfd13e818108d048]
aws_subnet.private-eu-west-1c: Refreshing state... [id=subnet-0272074e7447bcb51]
aws_eip.nat: Refreshing state... [id=eipalloc-07490a043b14e3e06]
aws_vpc.app1: Refreshing state... [id=vpc-055d14b6313f970f2]
aws_internet_gateway.igw: Refreshing state... [id=igw-026b41ad3f9e7eda2]
aws_security_group.app1-sg01-servers: Refreshing state... [id=sg-0749cac02452ea037]
aws_nat_gateway.nat: Refreshing state... [id=nat-065c480c426e9ce70]
aws_route_table.public: Refreshing state... [id=rtb-0d0eea00c904caaf5]
aws_launch_template.app1_LT: Refreshing state... [id=lt-022af3fe4f166b00c]
aws_route_table.private: Refreshing state... [id=rtb-0c5b5e2c9d7d3c0cd]
aws_launch_template.app1_LT: Drift detected (delete)
aws_route_table_association.private-eu-west-1c: Drift detected (delete)
aws_subnet.private-eu-west-1a: Drift detected (delete)
aws_vpc.app1: Drift detected (delete)
aws_subnet.public-eu-west-1b: Drift detected (delete)
aws_subnet.public-eu-west-1a: Drift detected (delete)
aws_subnet.private-eu-west-1b: Drift detected (delete)
aws_security_group.app1-sg01-servers: Drift detected (delete)
aws_route_table_association.private-eu-west-1b: Drift detected (delete)
aws_internet_gateway.igw: Drift detected (delete)
aws_route_table.private: Drift detected (delete)
aws_route_table_association.public-eu-west-1c: Drift detected (delete)
aws_route_table_association.private-eu-west-1a: Drift detected (delete)
aws_nat_gateway.nat: Drift detected (delete)
aws_eip.nat: Drift detected (delete)
aws_subnet.private-eu-west-1c: Drift detected (delete)
aws_subnet.public-eu-west-1c: Drift detected (delete)
aws_route_table.public: Drift detected (delete)
aws_route_table_association.public-eu-west-1a: Drift detected (delete)
aws_route_table_association.public-eu-west-1b: Drift detected (delete)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_eip.nat has been deleted
  - resource "aws_eip" "nat" {
      - id                       = "eipalloc-07490a043b14e3e06" -> null
        tags                     = {
            "Name" = "nat"
        }
        # (15 unchanged attributes hidden)
    }

  # aws_internet_gateway.igw has been deleted
  - resource "aws_internet_gateway" "igw" {
      - id       = "igw-026b41ad3f9e7eda2" -> null
        tags     = {
            "Name"    = "app1_IG"
            "Owner"   = "Luke"
            "Planet"  = "Musafar"
            "Service" = "application1"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_nat_gateway.nat has been deleted
  - resource "aws_nat_gateway" "nat" {
      - id                   = "nat-065c480c426e9ce70" -> null
        tags                 = {
            "Name" = "nat"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_route_table.private has been deleted
  - resource "aws_route_table" "private" {
      - id               = "rtb-0c5b5e2c9d7d3c0cd" -> null
        tags             = {
            "Name" = "private"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_route_table.public has been deleted
  - resource "aws_route_table" "public" {
      - id               = "rtb-0d0eea00c904caaf5" -> null
        tags             = {
            "Name" = "public"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_security_group.app1-sg01-servers has been deleted
  - resource "aws_security_group" "app1-sg01-servers" {
      - id                     = "sg-0749cac02452ea037" -> null
        name                   = "app1-sg01-servers"
        tags                   = {
            "Name"    = "app1-sg01-servers"
            "Owner"   = "Luke"
            "Planet"  = "Musafar"
            "Service" = "application1"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_vpc.app1 has been deleted
  - resource "aws_vpc" "app1" {
      - id                                   = "vpc-055d14b6313f970f2" -> null
        tags                                 = {
            "Name"    = "app1"
            "Owner"   = "Chewbacca"
            "Planet"  = "Mustafar"
            "Service" = "application1"
        }
        # (20 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "nat"
        }
      + tags_all             = {
          + "Name" = "nat"
        }
      + vpc                  = true
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"    = "app1_IG"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all = {
          + "Name"    = "app1_IG"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id   = (known after apply)
    }

  # aws_launch_template.app1_LT will be created
  + resource "aws_launch_template" "app1_LT" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-0e2c8caa4b6378d8c"
      + instance_type          = "t2.micro"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "app1_LT"
      + tags_all               = (known after apply)
      + user_data              = "IyEvYmluL2Jhc2gKeXVtIHVwZGF0ZSAteQp5dW0gaW5zdGFsbCAteSBodHRwZApzeXN0ZW1jdGwgc3RhcnQgaHR0cGQKc3lzdGVtY3RsIGVuYWJsZSBodHRwZAoKIyBHZXQgdGhlIElNRFN2MiB0b2tlbgpUT0tFTj0kKGN1cmwgLVggUFVUICJodHRwOi8vMTY5LjI1NC4xNjkuMjU0L2xhdGVzdC9hcGkvdG9rZW4iIC1IICJYLWF3cy1lYzItbWV0YWRhdGEtdG9rZW4tdHRsLXNlY29uZHM6IDIxNjAwIikKCiMgQmFja2dyb3VuZCB0aGUgY3VybCByZXF1ZXN0cwpjdXJsIC1IICJYLWF3cy1lYzItbWV0YWRhdGEtdG9rZW46ICRUT0tFTiIgLXMgaHR0cDovLzE2OS4yNTQuMTY5LjI1NC9sYXRlc3QvbWV0YS1kYXRhL2xvY2FsLWlwdjQgJj4gL3RtcC9sb2NhbF9pcHY0ICYKY3VybCAtSCAiWC1hd3MtZWMyLW1ldGFkYXRhLXRva2VuOiAkVE9LRU4iIC1zIGh0dHA6Ly8xNjkuMjU0LjE2OS4yNTQvbGF0ZXN0L21ldGEtZGF0YS9wbGFjZW1lbnQvYXZhaWxhYmlsaXR5LXpvbmUgJj4gL3RtcC9heiAmCmN1cmwgLUggIlgtYXdzLWVjMi1tZXRhZGF0YS10b2tlbjogJFRPS0VOIiAtcyBodHRwOi8vMTY5LjI1NC4xNjkuMjU0L2xhdGVzdC9tZXRhLWRhdGEvbmV0d29yay9pbnRlcmZhY2VzL21hY3MvICY+IC90bXAvbWFjaWQgJgp3YWl0CgptYWNpZD0kKGNhdCAvdG1wL21hY2lkKQpsb2NhbF9pcHY0PSQoY2F0IC90bXAvbG9jYWxfaXB2NCkKYXo9JChjYXQgL3RtcC9heikKdnBjPSQoY3VybCAtSCAiWC1hd3MtZWMyLW1ldGFkYXRhLXRva2VuOiAkVE9LRU4iIC1zIGh0dHA6Ly8xNjkuMjU0LjE2OS4yNTQvbGF0ZXN0L21ldGEtZGF0YS9uZXR3b3JrL2ludGVyZmFjZXMvbWFjcy8kbWFjaWQvdnBjLWlkKQoKIyBDcmVhdGUgSFRNTCBmaWxlCmNhdCA8PC1IVE1MID4gL3Zhci93d3cvaHRtbC9pbmRleC5odG1sCjwhZG9jdHlwZSBodG1sPgo8aHRtbCBsYW5nPSJlbiIgY2xhc3M9ImgtMTAwIj4KPGhlYWQ+Cjx0aXRsZT5EZXRhaWxzIGZvciBFQzIgaW5zdGFuY2U8L3RpdGxlPgo8L2hlYWQ+Cjxib2R5Pgo8ZGl2Pgo8aDE+TWFsZ3VzIENsYW48L2gxPgo8aDE+Q2hhaW5zIEJyb2tlbiBpbiBJcmVsYW5kPC9oMT4KPHA+PGI+SW5zdGFuY2UgTmFtZTo8L2I+ICQoaG9zdG5hbWUgLWYpIDwvcD4KPHA+PGI+SW5zdGFuY2UgUHJpdmF0ZSBJcCBBZGRyZXNzOiA8L2I+ICRsb2NhbF9pcHY0PC9wPgo8cD48Yj5BdmFpbGFiaWxpdHkgWm9uZTogPC9iPiAkYXo8L3A+CjxwPjxiPlZpcnR1YWwgUHJpdmF0ZSBDbG91ZCAoVlBDKTo8L2I+ICR2cGM8L3A+CjwvZGl2Pgo8L2JvZHk+CjwvaHRtbD4KSFRNTAoKIyBDbGVhbiB1cCB0aGUgdGVtcCBmaWxlcwpybSAtZiAvdG1wL2xvY2FsX2lwdjQgL3RtcC9heiAvdG1wL21hY2lkCg=="
      + vpc_security_group_ids = (known after apply)

      + metadata_options (known after apply)

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"    = "app1_LT"
              + "Owner"   = "Chewbacca"
              + "Planet"  = "Mustafar"
              + "Service" = "application1"
            }
        }
    }

  # aws_nat_gateway.nat will be created
  + resource "aws_nat_gateway" "nat" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "nat"
        }
      + tags_all             = {
          + "Name" = "nat"
        }
    }

  # aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "private"
        }
      + tags_all         = {
          + "Name" = "private"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "public"
        }
      + tags_all         = {
          + "Name" = "public"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private-us-east-1a will be created
  + resource "aws_route_table_association" "private-us-east-1a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private-us-east-1b will be created
  + resource "aws_route_table_association" "private-us-east-1b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private-us-east-1c will be created
  + resource "aws_route_table_association" "private-us-east-1c" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-us-east-1a will be created
  + resource "aws_route_table_association" "public-us-east-1a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-us-east-1b will be created
  + resource "aws_route_table_association" "public-us-east-1b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-us-east-1c will be created
  + resource "aws_route_table_association" "public-us-east-1c" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.app1-sg01-servers will be created
  + resource "aws_security_group" "app1-sg01-servers" {
      + arn                    = (known after apply)
      + description            = "app1-sg01-servers"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "MyEvilBox"
              + from_port        = 3389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3389
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "MyHomePage"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "app1-sg01-servers"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "app1-sg01-servers"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all               = {
          + "Name"    = "app1-sg01-servers"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.private-us-east-1a will be created
  + resource "aws_subnet" "private-us-east-1a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "private-us-east-1a"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "private-us-east-1a"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private-us-east-1b will be created
  + resource "aws_subnet" "private-us-east-1b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "private-us-east-1b"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "private-us-east-1b"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private-us-east-1c will be created
  + resource "aws_subnet" "private-us-east-1c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.13.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "private-us-east-1c"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "private-us-east-1c"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-us-east-1a will be created
  + resource "aws_subnet" "public-us-east-1a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "public-us-east-1a"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "public-us-east-1a"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-us-east-1b will be created
  + resource "aws_subnet" "public-us-east-1b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "public-us-east-1b"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "public-us-east-1b"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-us-east-1c will be created
  + resource "aws_subnet" "public-us-east-1c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"    = "public-us-east-1c"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + tags_all                                       = {
          + "Name"    = "public-us-east-1c"
          + "Owner"   = "Luke"
          + "Planet"  = "Musafar"
          + "Service" = "application1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.app1 will be created
  + resource "aws_vpc" "app1" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.32.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"    = "app1"
          + "Owner"   = "Chewbacca"
          + "Planet"  = "Mustafar"
          + "Service" = "application1"
        }
      + tags_all                             = {
          + "Name"    = "app1"
          + "Owner"   = "Chewbacca"
          + "Planet"  = "Mustafar"
          + "Service" = "application1"
        }
    }

Plan: 20 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @hgwizard, Action: `pull_request`*